mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/handlers.c
#if MICROPY_HW_USB_FS || MICROPY_HW_USB_HS
/**
  * @brief  This function handles USB OTG Common FS/HS Wakeup functions.
  * @param  *pcd_handle for FS or HS
  * @retval None
  */
STATIC void OTG_CMD_WKUP_Handler(PCD_HandleTypeDef *pcd_handle) {

  if (pcd_handle->Init.low_power_enable) {
    /* Reset SLEEPDEEP bit of Cortex System Control Register */
    SCB->SCR &= (uint32_t)~((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));

    /* Configures system clock after wake-up from STOP: enable HSE, PLL and select
    PLL as system clock source (HSE and PLL are disabled in STOP mode) */

    __HAL_RCC_HSE_CONFIG(MICROPY_HW_CLK_HSE_STATE);

    /* Wait till HSE is ready */
    while(__HAL_RCC_GET_FLAG(RCC_FLAG_HSERDY) == RESET)
    {}

    /* Enable the main PLL. */
    __HAL_RCC_PLL_ENABLE();

    /* Wait till PLL is ready */
    while(__HAL_RCC_GET_FLAG(RCC_FLAG_PLLRDY) == RESET)
    {}

    /* Select PLL as SYSCLK */
    MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, RCC_SYSCLKSOURCE_PLLCLK);

    #if defined(STM32H7)
    while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL1)
    {}
    #else
    while (__HAL_RCC_GET_SYSCLK_SOURCE() != RCC_CFGR_SWS_PLL)
    {}
    #endif

    /* ungate PHY clock */
     __HAL_PCD_UNGATE_PHYCLOCK(pcd_handle);
  }

}
#endif

#if MICROPY_HW_USB_FS
/**
  * @brief  This function handles USB OTG FS Wakeup IRQ Handler.
  * @param  None
  * @retval None
  */
void OTG_FS_WKUP_IRQHandler(void) {
    IRQ_ENTER(OTG_FS_WKUP_IRQn);

  OTG_CMD_WKUP_Handler(&pcd_fs_handle);

  /* Clear EXTI pending Bit*/
  __HAL_USB_FS_EXTI_CLEAR_FLAG();

    IRQ_EXIT(OTG_FS_WKUP_IRQn);
}
#endif

#if MICROPY_HW_USB_HS
/**
  * @brief  This function handles USB OTG HS Wakeup IRQ Handler.
  * @param  None
  * @retval None
  */
void OTG_HS_WKUP_IRQHandler(void) {
    IRQ_ENTER(OTG_HS_WKUP_IRQn);

  OTG_CMD_WKUP_Handler(&pcd_hs_handle);

  /* Clear EXTI pending Bit*/
  __HAL_USB_HS_EXTI_CLEAR_FLAG();

    IRQ_EXIT(OTG_HS_WKUP_IRQn);
}
#endif

/**
  * @brief  This function handles PPP interrupt request.
  * @param  None
  * @retval None
  */
/*void PPP_IRQHandler(void)
{
}*/

// Handle a flash (erase/program) interrupt.
void FLASH_IRQHandler(void) {
    IRQ_ENTER(FLASH_IRQn);
    // This calls the real flash IRQ handler, if needed
    /*
    uint32_t flash_cr = FLASH->CR;
    if ((flash_cr & FLASH_IT_EOP) || (flash_cr & FLASH_IT_ERR)) {
        HAL_FLASH_IRQHandler();
    }
    */
    // This call the storage IRQ handler, to check if the flash cache needs flushing
    // storage_irq_handler();
    IRQ_EXIT(FLASH_IRQn);
}

//#if defined(MICROPY_PY_USB_DEV_MSC)
void USB_IRQHandler(void) {
    IRQ_ENTER(USB_IRQn);
    uint32_t basepri_store;
    basepri_store = raise_irq_pri(1);
    uint32_t ui32Status = 0;
    //
    // Get the controller interrupt status.
    //
    ui32Status = MAP_USBIntStatusControl(USB0_BASE);
    // }
    //
    // Call the internal handler.
    //
    USBDeviceIntHandlerInternal(0, ui32Status);
    restore_irq_pri(basepri_store);
    IRQ_EXIT(USB_IRQn);
}
//#endif // defined(MICROPY_PY_USB_DEV_MSC)


void GPIOA_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTA_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTA_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOA_IntHndl);
}

void GPIOB_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTB_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTB_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOB_IntHndl);
}

void GPIOC_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTC_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTC_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOC_IntHndl);
}

void GPIOD_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTD_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTD_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOD_IntHndl);
}

void GPIOE_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTE_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTE_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOE_IntHndl);
}

void GPIOF_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTF_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTF_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOF_IntHndl);
}

void GPIOG_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTG_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTG_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOG_IntHndl);
}

void GPIOH_Handler(void)
{
    volatile u_int32_t intStat = 0;
    intStat = GPIOIntStatus(GPIO_PORTH_AHB_BASE, false);
    GPIOIntClear(GPIO_PORTH_AHB_BASE, intStat);
    Handle_EXTI_Irq(GPIOH_IntHndl);
}

void TIMER0AIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER0_BASE, TIMER_A);
}
void TIMER0BIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER0_BASE, TIMER_B);
}
void TIMER1AIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER1_BASE, TIMER_A);
}
void TIMER1BIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER1_BASE, TIMER_B);
}
void TIMER2AIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER2_BASE, TIMER_A);
}
void TIMER2BIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER2_BASE, TIMER_B);
}
void TIMER3AIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER3_BASE, TIMER_A);
}
void TIMER3BIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER3_BASE, TIMER_B);
}
void TIMER4AIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER4_BASE, TIMER_A);
}
void TIMER4BIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER4_BASE, TIMER_B);
}
void TIMER5AIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER5_BASE, TIMER_A);
}
void TIMER5BIntHandler(void) 
{
    TIMERGenericIntHandler(TIMER5_BASE, TIMER_B);
}

void PWM0GEN0_Handler(void)
{
    pwm_irq_handler(0, 0);
}
void PWM0GEN1_Handler(void)
{
    pwm_irq_handler(0, 1);
}
void PWM0GEN2_Handler(void)
{
    pwm_irq_handler(0, 2);
}
void PWM0GEN3_Handler(void)
{
    pwm_irq_handler(0, 3);
}
void PWM1GEN0_Handler(void)
{
    pwm_irq_handler(1, 0);
}
void PWM1GEN1_Handler(void)
{
    pwm_irq_handler(1, 1);
}
void PWM1GEN2_Handler(void)
{
    pwm_irq_handler(1, 2);
}
void PWM1GEN3_Handler(void)
{
    pwm_irq_handler(1, 3);
}

